Repository: SoftGeekRO/sg.webshop
Catalog: src/webstore/apps/siteSettings/locale/*/LC_MESSAGES/django.po
Languages: ro_ro

# maintenanceTitlePage
source: Webstore Work in Progress
ro_ro: Magazin online in lucru

# maintenanceWorkInProgressTitle
source: Maintenance mode
ro_ro: Pagina in lucru

# maintenanceAboutUsTitle
source: About Us
ro_ro: Despre noi

# maintenanceTrustBarConsulting
source: Consulting
ro_ro: Consultanta

# maintenanceTrustBarConsultingDescription
source: Our expert team will guide you to the right choice.
ro_ro: Personalul nostru specializat te va ajuta sa faci alegerea potrivita.

# maintenanceTrustBarDelivery
source: Fast Delivery
ro_ro: Livrare rapida

# maintenanceTrustBarDeliveryDescription
source: Items ship straight from the manufacturer or distributorâ€”fast and fresh!
ro_ro: Livram direct din stocurile producatorului sau al distribuitorului.

# maintenanceTrustBarPaymentMethods
source: Payments methods
ro_ro: Metode de plata

# maintenanceTrustBarPaymentMethodsDescription
source: Pay your way - choose what suits you best!
ro_ro: Alege plata care ti se potriveste.

# maintenanceContactUsTitle
source: Contact us:
ro_ro: Trimite un mesaj:

source: Location
ro_ro: Locatie:

source: Phone
ro_ro: Telefon:
